plantalog/cadi-gcl/stm32f100/current/ff9a/src/diskio.c
	//Ã�Â²Ã‘â€¹Ã�Â²Ã�Â¾Ã�Â´ SCK: Ã�Â²Ã‘â€¹Ã‘â€¦Ã�Â¾Ã�Â´ Ã�Â´Ã�Â²Ã‘Æ’Ã‘â€¦Ã‘â€šÃ�Â°Ã�ÂºÃ‘â€šÃ�Â½Ã‘â€¹Ã�Â¹, Ã�Â°Ã�Â»Ã‘Å’Ã‘â€šÃ�ÂµÃ‘â‚¬Ã�Â½Ã�Â°Ã‘â€šÃ�Â¸Ã�Â²Ã�Â½Ã�Â°Ã‘ï¿½ Ã‘â€žÃ‘Æ’Ã�Â½Ã�ÂºÃ‘â€ Ã�Â¸Ã‘ï¿½, 50MHz
	GPIOB->CRL |= GPIO_CRL_MODE3; //
	GPIOB->CRL &= ~GPIO_CRL_CNF3; //
	GPIOB->CRL |= GPIO_CRL_CNF3_1; //

	//Ã�Â²Ã‘â€¹Ã�Â²Ã�Â¾Ã�Â´ MISO: Ã�Â²Ã‘â€¦Ã�Â¾Ã�Â´ Ã‘â€ Ã�Â¸Ã‘â€žÃ‘â‚¬Ã�Â¾Ã�Â²Ã�Â¾Ã�Â¹ Ã‘ï¿½ Ã�Â¿Ã�Â¾Ã�Â´Ã‘â€šÃ‘ï¿½Ã�Â³Ã�Â¸Ã�Â²Ã�Â°Ã‘Å½Ã‘â€°Ã�Â¸Ã�Â¼ Ã‘â‚¬Ã�ÂµÃ�Â·Ã�Â¸Ã‘ï¿½Ã‘â€šÃ�Â¾Ã‘â‚¬Ã�Â¾Ã�Â¼, Ã�Â¿Ã�Â¾Ã�Â´Ã‘â€šÃ‘ï¿½Ã�Â¶Ã�ÂºÃ�Â° Ã�Âº Ã�Â¿Ã�Â»Ã‘Å½Ã‘ï¿½Ã‘Æ’
	GPIOB->CRL &= ~GPIO_CRL_MODE4; //
	GPIOB->CRL &= ~GPIO_CRL_CNF4; //
	GPIOB->CRL |= GPIO_CRL_CNF4_1; //
	GPIOB->BSRR = GPIO_BSRR_BS4; //

	//Ã�Â²Ã‘â€¹Ã�Â²Ã�Â¾Ã�Â´ MOSI: Ã�Â²Ã‘â€¹Ã‘â€¦Ã�Â¾Ã�Â´ Ã�Â´Ã�Â²Ã‘Æ’Ã‘â€¦Ã‘â€šÃ�Â°Ã�ÂºÃ‘â€šÃ�Â½Ã‘â€¹Ã�Â¹, Ã�Â°Ã�Â»Ã‘Å’Ã‘â€šÃ�ÂµÃ‘â‚¬Ã�Â½Ã�Â°Ã‘â€šÃ�Â¸Ã�Â²Ã�Â½Ã�Â°Ã‘ï¿½ Ã‘â€žÃ‘Æ’Ã�Â½Ã�ÂºÃ‘â€ Ã�Â¸Ã‘ï¿½, 50MHz
	GPIOB->CRL |= GPIO_CRL_MODE5; //
	GPIOB->CRL &= ~GPIO_CRL_CNF5; //
	GPIOB->CRL |= GPIO_CRL_CNF5_1; //

	//Ã�Â½Ã�Â°Ã‘ï¿½Ã‘â€šÃ‘â‚¬Ã�Â¾Ã�Â¸Ã‘â€šÃ‘Å’ Ã�Â¼Ã�Â¾Ã�Â´Ã‘Æ’Ã�Â»Ã‘Å’ SPI
	RCC->APB2ENR |= RCC_APB2ENR_SPI1EN; //Ã�Â¿Ã�Â¾Ã�Â´Ã�Â°Ã‘â€šÃ‘Å’ Ã‘â€šÃ�Â°Ã�ÂºÃ‘â€šÃ�Â¸Ã‘â‚¬Ã�Â¾Ã�Â²Ã�Â°Ã�Â½Ã�Â¸Ã�Âµ
	SPI1->CR2 = 0x0000; //
	SPI1->CR1 = SPI_CR1_MSTR; //Ã�ÂºÃ�Â¾Ã�Â½Ã‘â€šÃ‘â‚¬Ã�Â¾Ã�Â»Ã�Â»Ã�ÂµÃ‘â‚¬ Ã�Â´Ã�Â¾Ã�Â»Ã�Â¶Ã�ÂµÃ�Â½ Ã�Â±Ã‘â€¹Ã‘â€šÃ‘Å’ Ã�Â¼Ã�Â°Ã‘ï¿½Ã‘â€šÃ�ÂµÃ‘â‚¬Ã�Â¾Ã�Â¼,Ã�ÂºÃ�Â¾Ã�Â½Ã�ÂµÃ‘â€¡Ã�Â½Ã�Â¾
	SPI1->CR1 |= SPI_CR1_BR; //Ã�Â´Ã�Â»Ã‘ï¿½ Ã�Â½Ã�Â°Ã‘â€¡Ã�Â°Ã�Â»Ã�Â° Ã�Â·Ã�Â°Ã�Â´Ã�Â°Ã�Â´Ã�Â¸Ã�Â¼ Ã�Â¼Ã�Â°Ã�Â»Ã�ÂµÃ�Â½Ã‘Å’Ã�ÂºÃ‘Æ’Ã‘Å½ Ã‘ï¿½Ã�ÂºÃ�Â¾Ã‘â‚¬Ã�Â¾Ã‘ï¿½Ã‘â€šÃ‘Å’
	SPI1->CR1 |= SPI_CR1_SSI;
	SPI1->CR1 |= SPI_CR1_SSM;
	SPI1->CR1 |= SPI_CR1_SPE; //Ã‘â‚¬Ã�Â°Ã�Â·Ã‘â‚¬Ã�ÂµÃ‘Ë†Ã�Â¸Ã‘â€šÃ‘Å’ Ã‘â‚¬Ã�Â°Ã�Â±Ã�Â¾Ã‘â€šÃ‘Æ’ Ã�Â¼Ã�Â¾Ã�Â´Ã‘Æ’Ã�Â»Ã‘ï¿½ SPI

#ifdef STM32_SD_USE_DMA
	/* enable DMA clock */
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
#endif
}


// Thomas SPI INIT
/* static void power_on2(void)
{
	SPI_InitTypeDef  SPI_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;
	volatile BYTE dummyread;

	// Enable GPIO clock for CS
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_CS, ENABLE);
	// Enable SPI clock, SPI1: APB2, SPI2: APB1
	RCC_APBPeriphClockCmd_SPI_SD(RCC_APBPeriph_SPI_SD, ENABLE);

//	card_power(1);
//	socket_cp_init();
//	socket_wp_init();
//	 RCC->APB1ENR |= RCC_APB2ENR_TIM1EN;   //Ã�Â¿Ã�Â¾Ã�Â´Ã�Â°Ã‘â€šÃ‘Å’ Ã‘â€šÃ�Â°Ã�ÂºÃ‘â€šÃ�Â¸Ã‘â‚¬Ã�Â¾Ã�Â²Ã�Â°Ã�Â½Ã�Â¸Ã�Âµ Ã�Â½Ã�Â° TIM2
//	 TIM1->PSC     = 8000-1;               //Ã�Â½Ã�Â°Ã‘ï¿½Ã‘â€šÃ‘â‚¬Ã�Â¾Ã�Â¸Ã‘â€šÃ‘Å’ Ã�Â´Ã�ÂµÃ�Â»Ã�Â¸Ã‘â€šÃ�ÂµÃ�Â»Ã‘Å’ Ã�Â´Ã�Â»Ã‘ï¿½ Ã‘â€žÃ�Â¾Ã‘â‚¬Ã�Â¼Ã�Â¸Ã‘â‚¬Ã�Â¾Ã�Â²Ã�Â°Ã�Â½Ã�Â¸Ã‘ï¿½ Ã�Â¼Ã�Â¸Ã�Â»Ã�Â»Ã�Â¸Ã‘ï¿½Ã�ÂµÃ�ÂºÃ‘Æ’Ã�Â½Ã�Â´
//	 TIM1->CR1     = TIM_CR1_OPM;          //Ã‘â‚¬Ã�ÂµÃ�Â¶Ã�Â¸Ã�Â¼ Ã�Â¾Ã�Â´Ã�Â½Ã�Â¾Ã�Â³Ã�Â¾ Ã�Â¸Ã�Â¼Ã�Â¿Ã‘Æ’Ã�Â»Ã‘Å’Ã‘ï¿½Ã�Â°
//	for (Timer1 = 250; Timer1; );	// Wait for 250ms
	 RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;   //Ã�Â¿Ã�Â¾Ã�Â´Ã�Â°Ã‘â€šÃ‘Å’ Ã‘â€šÃ�Â°Ã�ÂºÃ‘â€šÃ�Â¸Ã‘â‚¬Ã�Â¾Ã�Â²Ã�Â°Ã�Â½Ã�Â¸Ã�Âµ Ã�Â½Ã�Â° TIM2
	 TIM2->PSC     = 8000-1;               //Ã�Â½Ã�Â°Ã‘ï¿½Ã‘â€šÃ‘â‚¬Ã�Â¾Ã�Â¸Ã‘â€šÃ‘Å’ Ã�Â´Ã�ÂµÃ�Â»Ã�Â¸Ã‘â€šÃ�ÂµÃ�Â»Ã‘Å’ Ã�Â´Ã�Â»Ã‘ï¿½ Ã‘â€žÃ�Â¾Ã‘â‚¬Ã�Â¼Ã�Â¸Ã‘â‚¬Ã�Â¾Ã�Â²Ã�Â°Ã�Â½Ã�Â¸Ã‘ï¿½ Ã�Â¼Ã�Â¸Ã�Â»Ã�Â»Ã�Â¸Ã‘ï¿½Ã�ÂµÃ�ÂºÃ‘Æ’Ã�Â½Ã�Â´
	 TIM2->CR1     = TIM_CR1_OPM;          //Ã‘â‚¬Ã�ÂµÃ�Â¶Ã�Â¸Ã�Â¼ Ã�Â¾Ã�Â´Ã�Â½Ã�Â¾Ã�Â³Ã�Â¾ Ã�Â¸Ã�Â¼Ã�Â¿Ã‘Æ’Ã�Â»Ã‘Å’Ã‘ï¿½Ã�Â°
	  TIM2->ARR = 250;                  //Ã�Â·Ã�Â°Ã�Â³Ã‘â‚¬Ã‘Æ’Ã�Â·Ã�Â¸Ã‘â€šÃ‘Å’ Ã�Â·Ã�Â½Ã�Â°Ã‘â€¡Ã�ÂµÃ�Â½Ã�Â¸Ã�Âµ Ã�Â·Ã�Â°Ã�Â´Ã�ÂµÃ‘â‚¬Ã�Â¶Ã�ÂºÃ�Â¸
	  TIM2->CNT = 0;
	  TIM2->CR1 = TIM_CR1_CEN;	      //Ã�Â·Ã�Â°Ã�Â¿Ã‘Æ’Ã‘ï¿½Ã‘â€šÃ�Â¸Ã‘â€šÃ‘Å’ Ã‘â€šÃ�Â°Ã�Â¹Ã�Â¼Ã�ÂµÃ‘â‚¬
	  while((TIM2->SR & TIM_SR_UIF)==0){} //Ã�Â´Ã�Â¾Ã�Â¶Ã�Â´Ã�Â°Ã‘â€šÃ‘Å’Ã‘ï¿½Ã‘ï¿½ Ã�ÂºÃ�Â¾Ã�Â½Ã‘â€ Ã�Â° Ã�Â·Ã�Â°Ã�Â´Ã�ÂµÃ‘â‚¬Ã�Â¶Ã�ÂºÃ�Â¸
	  TIM2->SR &= ~TIM_SR_UIF;	      //Ã‘ï¿½Ã�Â±Ã‘â‚¬Ã�Â¾Ã‘ï¿½Ã�Â¸Ã‘â€šÃ‘Å’ Ã‘â€žÃ�Â»Ã�Â°Ã�Â³

	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
	GPIO_PinRemapConfig(GPIO_Remap_SPI1, ENABLE);

	 // Configure I/O for Flash Chip select
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_CS;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIO_CS, &GPIO_InitStructure);

	// De-select the Card: Chip Select high
	DESELECT();

	// Configure SPI pins: SCK and MOSI with default alternate function (not re-mapped) push-pull
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_SPI_SD_SCK | GPIO_Pin_SPI_SD_MOSI;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
	GPIO_Init(GPIO_SPI_SD, &GPIO_InitStructure);
	// Configure MISO as Input with internal pull-up
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_SPI_SD_MISO;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPU;
	GPIO_Init(GPIO_SPI_SD, &GPIO_InitStructure);

	// SPI configuration
	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
	SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
	SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
	SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
	SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
	SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
	SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256; // 72000kHz/256=281kHz < 400kHz
	SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
	SPI_InitStructure.SPI_CRCPolynomial = 7;

	SPI_Init(SPI_SD, &SPI_InitStructure);
	SPI_CalculateCRC(SPI_SD, DISABLE);
	SPI_Cmd(SPI_SD, ENABLE);

	// drain SPI
	while (SPI_I2S_GetFlagStatus(SPI_SD, SPI_I2S_FLAG_TXE) == RESET) { ; }
	dummyread = SPI_I2S_ReceiveData(SPI_SD);

#ifdef STM32_SD_USE_DMA
	// enable DMA clock
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
#endif


}
*/


/*
// SPI1 init for PA4-PA7
static void power_on3(void){

	RCC->APB2ENR |= RCC_APB2ENR_AFIOEN;//Ã�Â²Ã�ÂºÃ�Â»Ã‘Å½Ã‘â€¡Ã�Â¸Ã‘â€šÃ‘Å’ Ã‘â€šÃ�Â°Ã�ÂºÃ‘â€šÃ�Â¸Ã‘â‚¬Ã�Â¾Ã�Â²Ã�Â°Ã�Â½Ã�Â¸Ã�Âµ Ã�Â°Ã�Â»Ã‘Å’Ã‘â€šÃ�ÂµÃ‘â‚¬Ã�Â½Ã�Â°Ã‘â€šÃ�Â¸Ã�Â²Ã�Â½Ã‘â€¹Ã‘â€¦ Ã‘â€žÃ‘Æ’Ã�Â½Ã�ÂºÃ‘â€ Ã�Â¸Ã�Â¹
	RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;//Ã�Â²Ã�ÂºÃ�Â»Ã‘Å½Ã‘â€¡Ã�Â¸Ã‘â€šÃ‘Å’ Ã‘â€šÃ�Â°Ã�ÂºÃ‘â€šÃ�Â¸Ã‘â‚¬Ã�Â¾Ã�Â²Ã�Â°Ã�Â½Ã�Â¸Ã�Âµ Ã�Â¿Ã�Â¾Ã‘â‚¬Ã‘â€šÃ�Â° Ã�ï¿½

	//Ã�Â²Ã‘â€¹Ã�Â²Ã�Â¾Ã�Â´ Ã‘Æ’Ã�Â¿Ã‘â‚¬Ã�Â°Ã�Â²Ã�Â»Ã�ÂµÃ�Â½Ã�Â¸Ã‘ï¿½ SS: Ã�Â²Ã‘â€¹Ã‘â€¦Ã�Â¾Ã�Â´ Ã�Â´Ã�Â²Ã‘Æ’Ã‘â€¦Ã‘â€šÃ�Â°Ã�ÂºÃ‘â€šÃ�Â½Ã‘â€¹Ã�Â¹, Ã�Â¾Ã�Â±Ã‘â€°Ã�ÂµÃ�Â³Ã�Â¾ Ã�Â½Ã�Â°Ã�Â·Ã�Â½Ã�Â°Ã‘â€¡Ã�ÂµÃ�Â½Ã�Â¸Ã‘ï¿½,50MHz
	GPIOA->CRL |= GPIO_CRL_MODE4; //
	GPIOA->CRL &= ~GPIO_CRL_CNF4; //
	GPIOA->BSRR = GPIO_BSRR_BS4; //

