plantalog/cadi-gcl/stm32f100/current/ff9a/src/diskio.c
	//Ã�Â²Ã‘â€¹Ã�Â²Ã�Â¾Ã�Â´ SCK: Ã�Â²Ã‘â€¹Ã‘â€¦Ã�Â¾Ã�Â´ Ã�Â´Ã�Â²Ã‘Æ’Ã‘â€¦Ã‘â€šÃ�Â°Ã�ÂºÃ‘â€šÃ�Â½Ã‘â€¹Ã�Â¹, Ã�Â°Ã�Â»Ã‘Å’Ã‘â€šÃ�ÂµÃ‘â‚¬Ã�Â½Ã�Â°Ã‘â€šÃ�Â¸Ã�Â²Ã�Â½Ã�Â°Ã‘ï¿½ Ã‘â€žÃ‘Æ’Ã�Â½Ã�ÂºÃ‘â€ Ã�Â¸Ã‘ï¿½, 50MHz
	GPIOA->CRL |= GPIO_CRL_MODE5; //
	GPIOA->CRL &= ~GPIO_CRL_CNF5; //
	GPIOA->CRL |= GPIO_CRL_CNF5_1; //

	//Ã�Â²Ã‘â€¹Ã�Â²Ã�Â¾Ã�Â´ MISO: Ã�Â²Ã‘â€¦Ã�Â¾Ã�Â´ Ã‘â€ Ã�Â¸Ã‘â€žÃ‘â‚¬Ã�Â¾Ã�Â²Ã�Â¾Ã�Â¹ Ã‘ï¿½ Ã�Â¿Ã�Â¾Ã�Â´Ã‘â€šÃ‘ï¿½Ã�Â³Ã�Â¸Ã�Â²Ã�Â°Ã‘Å½Ã‘â€°Ã�Â¸Ã�Â¼ Ã‘â‚¬Ã�ÂµÃ�Â·Ã�Â¸Ã‘ï¿½Ã‘â€šÃ�Â¾Ã‘â‚¬Ã�Â¾Ã�Â¼, Ã�Â¿Ã�Â¾Ã�Â´Ã‘â€šÃ‘ï¿½Ã�Â¶Ã�ÂºÃ�Â° Ã�Âº Ã�Â¿Ã�Â»Ã‘Å½Ã‘ï¿½Ã‘Æ’
	GPIOA->CRL &= ~GPIO_CRL_MODE6; //
	GPIOA->CRL &= ~GPIO_CRL_CNF6; //
	GPIOA->CRL |= GPIO_CRL_CNF6_1; //
	GPIOA->BSRR = GPIO_BSRR_BS6; //

	//Ã�Â²Ã‘â€¹Ã�Â²Ã�Â¾Ã�Â´ MOSI: Ã�Â²Ã‘â€¹Ã‘â€¦Ã�Â¾Ã�Â´ Ã�Â´Ã�Â²Ã‘Æ’Ã‘â€¦Ã‘â€šÃ�Â°Ã�ÂºÃ‘â€šÃ�Â½Ã‘â€¹Ã�Â¹, Ã�Â°Ã�Â»Ã‘Å’Ã‘â€šÃ�ÂµÃ‘â‚¬Ã�Â½Ã�Â°Ã‘â€šÃ�Â¸Ã�Â²Ã�Â½Ã�Â°Ã‘ï¿½ Ã‘â€žÃ‘Æ’Ã�Â½Ã�ÂºÃ‘â€ Ã�Â¸Ã‘ï¿½, 50MHz
	GPIOA->CRL |= GPIO_CRL_MODE7; //
	GPIOA->CRL &= ~GPIO_CRL_CNF7; //
	GPIOA->CRL |= GPIO_CRL_CNF7_1; //

	//Ã�Â½Ã�Â°Ã‘ï¿½Ã‘â€šÃ‘â‚¬Ã�Â¾Ã�Â¸Ã‘â€šÃ‘Å’ Ã�Â¼Ã�Â¾Ã�Â´Ã‘Æ’Ã�Â»Ã‘Å’ SPI
	RCC->APB2ENR |= RCC_APB2ENR_SPI1EN; //Ã�Â¿Ã�Â¾Ã�Â´Ã�Â°Ã‘â€šÃ‘Å’ Ã‘â€šÃ�Â°Ã�ÂºÃ‘â€šÃ�Â¸Ã‘â‚¬Ã�Â¾Ã�Â²Ã�Â°Ã�Â½Ã�Â¸Ã�Âµ
	SPI1->CR2 = 0x0000; //
	SPI1->CR1 = SPI_CR1_MSTR; //Ã�ÂºÃ�Â¾Ã�Â½Ã‘â€šÃ‘â‚¬Ã�Â¾Ã�Â»Ã�Â»Ã�ÂµÃ‘â‚¬ Ã�Â´Ã�Â¾Ã�Â»Ã�Â¶Ã�ÂµÃ�Â½ Ã�Â±Ã‘â€¹Ã‘â€šÃ‘Å’ Ã�Â¼Ã�Â°Ã‘ï¿½Ã‘â€šÃ�ÂµÃ‘â‚¬Ã�Â¾Ã�Â¼,Ã�ÂºÃ�Â¾Ã�Â½Ã�ÂµÃ‘â€¡Ã�Â½Ã�Â¾
	SPI1->CR1 |= SPI_CR1_BR; //Ã�Â´Ã�Â»Ã‘ï¿½ Ã�Â½Ã�Â°Ã‘â€¡Ã�Â°Ã�Â»Ã�Â° Ã�Â·Ã�Â°Ã�Â´Ã�Â°Ã�Â´Ã�Â¸Ã�Â¼ Ã�Â¼Ã�Â°Ã�Â»Ã�ÂµÃ�Â½Ã‘Å’Ã�ÂºÃ‘Æ’Ã‘Å½ Ã‘ï¿½Ã�ÂºÃ�Â¾Ã‘â‚¬Ã�Â¾Ã‘ï¿½Ã‘â€šÃ‘Å’
	SPI1->CR1 |= SPI_CR1_SSI;
	SPI1->CR1 |= SPI_CR1_SSM;
	SPI1->CR1 |= SPI_CR1_SPE; //Ã‘â‚¬Ã�Â°Ã�Â·Ã‘â‚¬Ã�ÂµÃ‘Ë†Ã�Â¸Ã‘â€šÃ‘Å’ Ã‘â‚¬Ã�Â°Ã�Â±Ã�Â¾Ã‘â€šÃ‘Æ’ Ã�Â¼Ã�Â¾Ã�Â´Ã‘Æ’Ã�Â»Ã‘ï¿½ SPI
}
*/
static
void power_off (void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	if (!(Stat & STA_NOINIT)) {
		SELECT();
		wait_ready();
		release_spi();
	}

	SPI_I2S_DeInit(SPI_SD);
	SPI_Cmd(SPI_SD, DISABLE);
	RCC_APBPeriphClockCmd_SPI_SD(RCC_APBPeriph_SPI_SD, DISABLE);

	// All SPI-Pins to input with weak internal pull-downs
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_SPI_SD_SCK | GPIO_Pin_SPI_SD_MISO | GPIO_Pin_SPI_SD_MOSI;
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IPD;
	GPIO_Init(GPIO_SPI_SD, &GPIO_InitStructure);

	card_power(0);

	Stat |= STA_NOINIT;		/// Set STA_NOINIT
}


/*-----------------------------------------------------------------------*/
/* Receive a data packet from MMC                                        */
/*-----------------------------------------------------------------------*/

static BOOL rcvr_datablock (
	BYTE *buff,			/* Data buffer to store received data */
	UINT btr			/* Byte count (must be multiple of 4) */
)
{
	BYTE token;


	Timer1 = 10;
	do {							/* Wait for data packet in timeout of 100ms */
		token = rcvr_spi();
	} while ((token == 0xFF) && Timer1);
	if(token != 0xFE) return FALSE;	/* If not valid data token, return with error */

#ifdef STM32_SD_USE_DMA
	stm32_dma_transfer( TRUE, buff, btr );
#else
	do {							/* Receive the data block into buffer */
		rcvr_spi_m(buff++);
		rcvr_spi_m(buff++);
		rcvr_spi_m(buff++);
		rcvr_spi_m(buff++);
	} while (btr -= 4);
#endif /* STM32_SD_USE_DMA */

	rcvr_spi();						/* Discard CRC */
	rcvr_spi();

	return TRUE;					/* Return with success */
}



/*-----------------------------------------------------------------------*/
/* Send a data packet to MMC                                             */
/*-----------------------------------------------------------------------*/

#if _FS_READONLY == 0
static
BOOL xmit_datablock (
	const BYTE *buff,	/* 512 byte data block to be transmitted */
	BYTE token			/* Data/Stop token */
)
{
	BYTE resp;
#ifndef STM32_SD_USE_DMA
	BYTE wc;
#endif

	if (wait_ready() != 0xFF) return FALSE;

	xmit_spi(token);					/* transmit data token */
	if (token != 0xFD) {	/* Is data token */

#ifdef STM32_SD_USE_DMA
		stm32_dma_transfer( FALSE, buff, 512 );
#else
		wc = 0;
		do {							/* transmit the 512 byte data block to MMC */
			xmit_spi(*buff++);
			xmit_spi(*buff++);
		} while (--wc);
#endif /* STM32_SD_USE_DMA */

		xmit_spi(0xFF);					/* CRC (Dummy) */
		xmit_spi(0xFF);
		resp = rcvr_spi();				/* Receive data response */
		if ((resp & 0x1F) != 0x05)		/* If not accepted, return with error */
			return FALSE;
	}

	return TRUE;
}
#endif /* _READONLY */



/*-----------------------------------------------------------------------*/
/* Send a command packet to MMC                                          */
/*-----------------------------------------------------------------------*/

static
BYTE send_cmd (
	BYTE cmd,		/* Command byte */
	DWORD arg		/* Argument */
)
{
	BYTE n, res;


	if (cmd & 0x80) {	/* ACMD<n> is the command sequence of CMD55-CMD<n> */
		cmd &= 0x7F;
		res = send_cmd(CMD55, 0);
		if (res > 1) return res;
	}

	/* Select the card and wait for ready */
	DESELECT();
	SELECT();
	if (wait_ready() != 0xFF) {
		return 0xFF;
	}

	/* Send command packet */
	xmit_spi(cmd);						/* Start + Command index */
	xmit_spi((BYTE)(arg >> 24));		/* Argument[31..24] */
	xmit_spi((BYTE)(arg >> 16));		/* Argument[23..16] */
	xmit_spi((BYTE)(arg >> 8));			/* Argument[15..8] */
	xmit_spi((BYTE)arg);				/* Argument[7..0] */
	n = 0x01;							/* Dummy CRC + Stop */
	if (cmd == CMD0) n = 0x95;			/* Valid CRC for CMD0(0) */
	if (cmd == CMD8) n = 0x87;			/* Valid CRC for CMD8(0x1AA) */
	xmit_spi(n);

	/* Receive command response */
	if (cmd == CMD12) rcvr_spi();		/* Skip a stuff byte when stop reading */

	n = 10;								/* Wait for a valid response in timeout of 10 attempts */
	do
		res = rcvr_spi();
	while ((res & 0x80) && --n);

	return res;			/* Return with the response value */
}



/*--------------------------------------------------------------------------

   Public Functions

---------------------------------------------------------------------------*/


/*-----------------------------------------------------------------------*/
/* Initialize Disk Drive                                                 */
/*-----------------------------------------------------------------------*/

DSTATUS disk_initialize (
	BYTE drv		/* Physical drive number (0) */
)
{
	BYTE n, cmd, ty, ocr[4];

	if (drv) return STA_NOINIT;			/* Supports only single drive */
	if (Stat & STA_NODISK) return Stat;	/* No card in the socket */

	power_on();							/* Force socket power on and initialize interface */
	interface_speed(INTERFACE_SLOW);
	for (n = 10; n; n--) rcvr_spi();	/* 80 dummy clocks */

